# Library Imports

In [1]:
import pandas as pd

# If not already installed on your machines, run this line of code
# Before re-running line above
!pip install pandas
!pip install numpy

# Importing Excel files

## Documentation

[Documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_excel.html) of `read_excel` function

*It can also be accessed in Jupyter Notebook with `Shift + Tab` when cursor is placed within function brackets*

## Importing excel file (.xlsx)

In [2]:
# Reading excel file (.xls / .xlsx) from same folder
data = pd.read_excel('Data file.xlsx')                # Note the file format added at the end of file name!

### Common error

- The excel file must be located in **same folder** as python file, unless other location is specified
- The excel file to be read must be **closed**, otherwise a **Permission Error** will arise

In [3]:
data.head()

      Month  Energy
0   January    2844
1  February    3726
2     March    4780
3     April    4892
4       May    5550

## Importing csv file (.csv)

In [4]:
# Reading csv file (.csv) from same folder
data = pd.read_csv('Data file.csv')                 # Note the file format added at the end of file name!

In [5]:
data.head()

      Month Energy
0   January  2,844
1  February  3,726
2     March  4,780
3     April  4,892
4       May  5,550

## Importing from other location

To import from another location, the code requires the name & location of the folder, either:
- **Relative** from current working folder (running python file)
- **Absolute** path from C:\ drive (exact location i.e. copy-paste from folder address)

### Relative path imports

In [6]:
# A relative path can be input directly as a 'file name'
data = pd.read_csv(r'data/Data file.csv')

*Note the **r'...'** - allows the content within '...' to be interpreted as text, not code and therefore " \ ", " . " , " & " and other characters can be used*

Useful characters:
- **Forward dash** ( " r / folder name / file name.csv " ) to go into 'child' sub-folder
- **Double dots** ( " r /  ..  / file name.csv " ) to go into parent folder 
- Chaining to reach specific folder ( " r / .. / .. / folder 1 / sub-folder 1 / file name.csv ")

### Absolute path imports

In [9]:
# Absolute paths can also be input directly as a 'file name' 
data = pd.read_csv(r'C:\Users\SAL78940\OneDrive - Mott MacDonald\Desktop\Data file.csv')

*Note this file path is usually specific to each users & will need to be changed if sharing code with colleagues*

## Useful import function parameters

### Importing specific sheet

In [10]:
data = pd.read_excel('./data/Data file.xlsx', sheet_name='Hourly')

In [11]:
data.head()

                 Date    METER
0 2019-12-01 00:30:00 -175.244
1 2019-12-01 01:30:00 -179.332
2 2019-12-01 02:30:00 -188.848
3 2019-12-01 03:30:00 -191.579
4 2019-12-01 04:30:00 -179.579

### Reading headers

In [12]:
# Header as a numerical input, starting from 0 = row 1
data = pd.read_excel('Data file.xlsx', header=0)

In [13]:
data.head()

      Month  Energy
0   January    2844
1  February    3726
2     March    4780
3     April    4892
4       May    5550

### Reading index colum

In [14]:
# Index column as a numerical input, starting from 0 = col A
data = pd.read_excel('Data file.xlsx', index_col=0)

In [15]:
data.head()

          Energy
Month
January     2844
February    3726
March       4780
April       4892
May         5550

### Reading specific column only

In [16]:
# Column as a numerical input, starting from 0 = col A
data = pd.read_excel('Data file.xlsx', usecols=[0,1])

In [17]:
data.head()

      Month  Energy
0   January    2844
1  February    3726
2     March    4780
3     April    4892
4       May    5550

### Skipping rows

In [18]:
# Row as a numerical input, starting from 0 = row 1
data = pd.read_excel('Data file.xlsx', skiprows=3)

In [19]:
data.head()

    March  4780
0   April  4892
1     May  5550
2    June  5959
3    July  7017
4  August  7393

### Registering N/A values

By default the following values are interpreted as NaN: 

*'  ', '#N/A', '#N/A N/A', '#NA', '-1.#IND', '-1.#QNAN', '-NaN', '-nan','1.#IND', '1.#QNAN', 'N/A', 'NA', 'NULL', 'NaN', 'n/a', 'nan', 'null'*.

In [20]:
data = pd.read_excel('Data file.xlsx', na_values='#DIV/0!')

### Encoding Errors

If a weird symbols appear, try encoding into another format:

In [24]:
# ASCII input
data = pd.read_csv('Data file.csv', encoding="ISO-8859-1")

In [25]:
# UTF-8 input
data = pd.read_csv('Data file.csv', encoding="UTF-8")

# Data overview

In [26]:
data = pd.read_csv('./data/electricity-wholesale.csv', index_col=0, parse_dates=True)

## First and last rows

In [27]:
# Show first rows of dataset
data.head(3) # Number of rows to display as input

,EU Average,EU - Max,EU - Min,Austria,Belgium,Bulgaria,Czech Republic,Germany,Denmark,Estonia,...,Canada,China,India,Japan,South Africa,South Korea,Turkey,USA,Switzerland,Norway
Category,,,,,,,,,,,,,,,,,,,,,
2008-01-01,72.16,114.22,51.24,63.23,72.44,NaN,NaN,62.22,52.47,NaN,...,31.58,111.04,NaN,107.66,NaN,97.12,NaN,75.61,80.22,50.93
2008-02-01,70.45,110.44,44.13,65.44,69.79,NaN,NaN,66.08,50.45,NaN,...,40.43,112.73,NaN,120.29,NaN,97.92,NaN,75.13,78.85,42.82
2008-03-01,64.62,84.13,35.41,59.88,71.65,NaN,NaN,59.26,40.26,NaN,...,43.25,112.73,NaN,103.72,NaN,100.87,NaN,78.49,78.33,32.88

In [28]:
# Show last rows of dataset
data.tail(3)

,EU Average,EU - Max,EU - Min,Austria,Belgium,Bulgaria,Czech Republic,Germany,Denmark,Estonia,...,Canada,China,India,Japan,South Africa,South Korea,Turkey,USA,Switzerland,Norway
Category,,,,,,,,,,,,,,,,,,,,,
2019-10-01,42.45,65.57,34.02,NaN,NaN,NaN,38.08,36.31,34.02,46.85,...,4.68,80.88,32.28,63.20,49.80,67.68,43.95,26.36,NaN,36.47
2019-11-01,43.41,54.36,40.30,NaN,NaN,NaN,41.27,40.30,42.63,44.94,...,13.27,80.88,33.97,59.51,60.61,62.78,44.89,31.35,NaN,41.43
2019-12-01,36.54,58.68,31.42,NaN,NaN,NaN,36.64,31.42,50.11,38.38,...,14.04,80.88,34.81,63.06,70.50,64.58,43.90,29.74,NaN,36.16

## Dataset information

In [29]:
# Show dataset information
data.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 144 entries, 2008-01-01 to 2019-12-01
Data columns (total 41 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   EU Average      144 non-null    float64
 1   EU - Max        144 non-null    float64
 2   EU - Min        144 non-null    float64
 3   Austria         132 non-null    float64
 4   Belgium         132 non-null    float64
 5   Bulgaria        36 non-null     float64
 6   Czech Republic  123 non-null    float64
 7   Germany         144 non-null    float64
 8   Denmark         144 non-null    float64
 9   Estonia         117 non-null    float64
 10  Greece          144 non-null    float64
 11  Spain           144 non-null    float64
 12  Finland         144 non-null    float64
 13  France          144 non-null    float64
 14  Croatia         12 non-null     float64
 15  Hungary         114 non-null    float64
 16  Ireland         108 non-null    float64
 17  Italy           144 non-null    float64
 18  Lithuania       90 non-null     float64
 19  Luxembourg      132 non-null    float64
 20  Latvia          78 non-null     float64
 21  Malta           144 non-null    float64
 22  Netherlands     132 non-null    float64
 23  Poland          126 non-null    float64
 24  Portugal        132 non-null    float64
 25  Romania         144 non-null    float64
 26  Sweden          144 non-null    float64
 27  Slovenia        104 non-null    float64
 28  Slovakia        120 non-null    float64
 29  United Kingdom  70 non-null     float64
 30  Brazil          144 non-null    float64
 31  Canada          144 non-null    float64
 32  China           144 non-null    float64
 33  India           139 non-null    float64
 34  Japan           144 non-null    float64
 35  South Africa    57 non-null     float64
 36  South Korea     144 non-null    float64
 37  Turkey          97 non-null     float64
 38  USA             144 non-null    float64
 39  Switzerland     132 non-null    float64
 40  Norway          144 non-null    float64
dtypes: float64(41)
memory usage: 47.2 KB

Basic information available for check:
- `RangeIndex`: Number of entries ¦ start to end
- `Data columns`: (total)
- `Column 1`: Index ¦ Column name ¦ Numer of values ¦ Nulls? ¦ Data Type
- `Column 2`: ...
- `Column 3`: ...
- `dtypes`: List of different data types in dataframe
- `memory usage`: How large the file is in memory

The data type (dtype) is an important parameter to check:
- **int64:** integers
- **float64:** decimals
- **datetime64:** python datetime format
- **bool:** true / false boolean 
- **object:** any other format (e.g. text)

**NOTE:** A column containing multiple data types will be given the 'object' type! 

If a column meant to contain certain datatype is registered as 'object' type, open excel and ensure that it does not contain a mix of datatypes

## Statistical overview

In [30]:
# Only works on columns with numerical inputs
data.describe()

,EU Average,EU - Max,EU - Min,Austria,Belgium,Bulgaria,Czech Republic,Germany,Denmark,Estonia,...,Canada,China,India,Japan,South Africa,South Korea,Turkey,USA,Switzerland,Norway
count,144.000000,144.000000,144.000000,132.000000,132.000000,36.000000,123.000000,144.000000,144.000000,117.000000,...,144.000000,144.000000,139.000000,144.000000,57.000000,144.000000,97.000000,144.000000,132.000000,144.000000
mean,48.784306,85.452847,34.273264,44.235985,50.315455,37.281389,40.983577,43.198819,41.240417,41.396581,...,19.609236,106.903750,58.770791,85.452361,55.951228,94.849583,38.801237,39.444861,51.626061,38.544722
std,11.919581,25.745180,9.720656,13.906264,14.018532,7.781681,8.959404,13.233849,12.864424,7.777156,...,10.453756,9.552976,36.547589,27.490119,17.278344,27.288283,7.643859,15.508232,16.610982,13.167074
min,27.420000,39.860000,9.350000,23.070000,25.950000,22.580000,23.900000,22.490000,14.150000,27.560000,...,2.130000,80.880000,28.920000,43.660000,27.110000,51.570000,23.600000,17.280000,24.210000,9.850000
25%,40.547500,63.827500,28.610000,33.370000,40.397500,32.062500,34.400000,33.405000,32.132500,34.780000,...,12.207500,104.475000,38.525000,61.825000,42.010000,69.685000,32.570000,29.920000,37.657500,30.177500
50%,46.575000,84.685000,33.000000,41.030000,48.275000,36.970000,39.470000,40.165000,39.180000,41.460000,...,17.970000,108.900000,46.340000,77.695000,50.350000,98.125000,38.590000,36.145000,50.560000,36.375000
75%,54.200000,100.697500,37.965000,52.100000,57.122500,40.517500,46.020000,49.685000,48.822500,46.470000,...,23.107500,111.250000,58.880000,111.237500,70.750000,116.660000,44.650000,42.012500,61.810000,45.207500
max,94.840000,173.560000,69.400000,99.100000,99.460000,57.260000,61.240000,98.100000,86.300000,61.920000,...,55.820000,121.400000,216.840000,154.200000,91.910000,154.880000,57.430000,105.690000,107.530000,89.290000

# Manipulate data

In [31]:
data = pd.read_csv('./data/electricity-wholesale.csv', index_col=0, parse_dates=True)

## Basics

### Lookup values

#### Using `loc`

There are two basic methods to look-up values:
- `.loc[index_start:index_end , column_start:column_end]`: inclusive of `_end` values

In [32]:
data.loc['2010-01-01':'2010-12-01','EU Average':'EU - Min'] # Return all columns from 'EU Average' to 'EU - Min', 
                                                            # including 'EU - Min'

            EU Average  EU - Max  EU - Min
Category
2010-01-01       52.09    106.88     30.30
2010-02-01       53.72    116.08     30.28
2010-03-01       46.99     85.58     21.47
2010-04-01       46.47     85.67     28.61
2010-05-01       47.70    121.07     38.07
2010-06-01       49.08    106.52     34.10
2010-07-01       53.34     97.29     37.93
2010-08-01       49.21     99.70     35.84
2010-09-01       53.79     90.97     40.81
2010-10-01       57.87    101.74     45.91
2010-11-01       55.02     77.96     43.15
2010-12-01       65.29    100.46     34.48

#### Using `iloc`

- `.iloc[index_num_start:index_num_end , col_num_start:col_num_end]`: exclusive of `_end` values

In [33]:
data.iloc[24:36, 0:3] # Returns column 0 ('EU Average'), 1 ('EU - Max') and 2 ('EU - Min'), 
                      # but not column 3 ('Austria')

            EU Average  EU - Max  EU - Min
Category
2010-01-01       52.09    106.88     30.30
2010-02-01       53.72    116.08     30.28
2010-03-01       46.99     85.58     21.47
2010-04-01       46.47     85.67     28.61
2010-05-01       47.70    121.07     38.07
2010-06-01       49.08    106.52     34.10
2010-07-01       53.34     97.29     37.93
2010-08-01       49.21     99.70     35.84
2010-09-01       53.79     90.97     40.81
2010-10-01       57.87    101.74     45.91
2010-11-01       55.02     77.96     43.15
2010-12-01       65.29    100.46     34.48

#### Shortcut for column selection

It is possible to also select rows and columns using this short-hand

In [34]:
# Single brackets to select one column
data['EU Average']

Category
2008-01-01    72.16
2008-02-01    70.45
2008-03-01    64.62
2008-04-01    72.10
2008-05-01    65.90
              ...
2019-08-01    40.82
2019-09-01    40.67
2019-10-01    42.45
2019-11-01    43.41
2019-12-01    36.54
Name: EU Average, Length: 144, dtype: float64

In [35]:
# Double brackets to select multiple columns
data[['EU - Max', 'Austria','Spain']]

            EU - Max  Austria  Spain
Category
2008-01-01    114.22    63.23  79.59
2008-02-01    110.44    65.44  77.48
2008-03-01     84.13    59.88  66.45
2008-04-01    114.52    74.10  63.02
2008-05-01    146.81    63.53  63.20
...              ...      ...    ...
2019-08-01     72.65      NaN  44.19
2019-09-01     59.86      NaN  41.39
2019-10-01     65.57      NaN  46.37
2019-11-01     54.36      NaN  41.47
2019-12-01     58.68      NaN  33.22

[144 rows x 3 columns]

### Change column names

#### Change index name

In [36]:
data.index.name = 'Date'
data.head()

,EU Average,EU - Max,EU - Min,Austria,Belgium,Bulgaria,Czech Republic,Germany,Denmark,Estonia,...,Canada,China,India,Japan,South Africa,South Korea,Turkey,USA,Switzerland,Norway
Date,,,,,,,,,,,,,,,,,,,,,
2008-01-01,72.16,114.22,51.24,63.23,72.44,NaN,NaN,62.22,52.47,NaN,...,31.58,111.04,NaN,107.66,NaN,97.12,NaN,75.61,80.22,50.93
2008-02-01,70.45,110.44,44.13,65.44,69.79,NaN,NaN,66.08,50.45,NaN,...,40.43,112.73,NaN,120.29,NaN,97.92,NaN,75.13,78.85,42.82
2008-03-01,64.62,84.13,35.41,59.88,71.65,NaN,NaN,59.26,40.26,NaN,...,43.25,112.73,NaN,103.72,NaN,100.87,NaN,78.49,78.33,32.88
2008-04-01,72.10,114.52,35.41,74.10,84.55,NaN,NaN,74.96,40.26,NaN,...,38.20,112.73,NaN,78.26,NaN,101.49,NaN,88.04,84.23,32.88
2008-05-01,65.90,146.81,42.63,63.53,75.99,NaN,NaN,62.48,59.33,NaN,...,27.12,112.73,NaN,72.93,NaN,98.88,NaN,81.16,63.76,28.66

#### Change column names

In [37]:
data.rename(columns = {'EU Average': 'EU Av',
                       'EU - Max' : 'EU Max',
                       'EU - Min': 'EU Min'},
            inplace = True)
data.head()

,EU Av,EU Max,EU Min,Austria,Belgium,Bulgaria,Czech Republic,Germany,Denmark,Estonia,...,Canada,China,India,Japan,South Africa,South Korea,Turkey,USA,Switzerland,Norway
Date,,,,,,,,,,,,,,,,,,,,,
2008-01-01,72.16,114.22,51.24,63.23,72.44,NaN,NaN,62.22,52.47,NaN,...,31.58,111.04,NaN,107.66,NaN,97.12,NaN,75.61,80.22,50.93
2008-02-01,70.45,110.44,44.13,65.44,69.79,NaN,NaN,66.08,50.45,NaN,...,40.43,112.73,NaN,120.29,NaN,97.92,NaN,75.13,78.85,42.82
2008-03-01,64.62,84.13,35.41,59.88,71.65,NaN,NaN,59.26,40.26,NaN,...,43.25,112.73,NaN,103.72,NaN,100.87,NaN,78.49,78.33,32.88
2008-04-01,72.10,114.52,35.41,74.10,84.55,NaN,NaN,74.96,40.26,NaN,...,38.20,112.73,NaN,78.26,NaN,101.49,NaN,88.04,84.23,32.88
2008-05-01,65.90,146.81,42.63,63.53,75.99,NaN,NaN,62.48,59.33,NaN,...,27.12,112.73,NaN,72.93,NaN,98.88,NaN,81.16,63.76,28.66

## Filters & Conditionals

### Creating a filter

You can filter the dataframe, or a column using a conditional

In [38]:
filter_1 = data['EU Av'] > 80
filter_1

Date
2008-01-01    False
2008-02-01    False
2008-03-01    False
2008-04-01    False
2008-05-01    False
              ...
2019-08-01    False
2019-09-01    False
2019-10-01    False
2019-11-01    False
2019-12-01    False
Name: EU Av, Length: 144, dtype: bool

### Applying a filter

In [39]:
data.loc[filter_1, 'EU Av']

Date
2008-07-01    81.57
2008-09-01    94.84
2008-10-01    92.19
Name: EU Av, dtype: float64

### !Warning! - `SettingWithCopy`

You may get `'Setting with Copy Warning'` when chaining filter assignments & changing values returned.

See this [explaination](https://www.dataquest.io/blog/settingwithcopywarning/) for more information.

In [40]:
pd.set_option('mode.chained_assignment', 'warn')

#### **Example**

*1. Filtering for data before 2010*

In [41]:
data_2010 = data.index < '2010-01-01'

*3. Then **chaining with another filter** (here `['Denmark']` to only select that column) AND **changing the values**, will raise the `SettingWithCopy` warning/error*

In [42]:
data[data_2010]['Denmark'] = 100

C:\Users\SAL78940\AppData\Local\Temp\ipykernel_29824\2674094292.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data[data_2010]['Denmark'] = 100

Chaining the filters as such, allows us to **view the data**, but **not to edit it**!

In [44]:
data[data_2010]['Denmark'].head(5)

Date
2008-01-01    52.47
2008-02-01    50.45
2008-03-01    40.26
2008-04-01    40.26
2008-05-01    59.33
Name: Denmark, dtype: float64

That is because pandas is **quietly creating a copy** of the original dataframe with the first filter, and then filtering the copy with the second filter.

#### Solution

**To avoid error/warning**: Avoid chaining arguments, and resolve within one line:

In [45]:
data.loc[data.index < '2010-01-01','Denmark'] = 100

In [46]:
data.loc['2008-01-01':'2010-01-01','Denmark'].head(3)

Date
2008-01-01    100.0
2008-02-01    100.0
2008-03-01    100.0
Name: Denmark, dtype: float64

**OR** actually copy the partial view created before chaining the assignment on the copy

In [47]:
data_pre_2010 = data[data.index < '2010-01-01'].copy()

In [48]:
data_pre_2010['Denmark'] = 50

In [49]:
data_pre_2010['Denmark'].head(3)

Date
2008-01-01    50
2008-02-01    50
2008-03-01    50
Name: Denmark, dtype: int64

In [50]:
# Which does not change the original series
data.loc['2008-01-01':'2010-01-01','Denmark'].head(3)

Date
2008-01-01    100.0
2008-02-01    100.0
2008-03-01    100.0
Name: Denmark, dtype: float64

## Groupby

### Basic

In [51]:
yearly_groups = data.groupby(data.index.year) # Groupby can also be applied to columns

In [52]:
for year, yearly_data in yearly_groups:
    print(year)
    print(yearly_data.sum()) # Some methodology for each group's values
                             # E.g. display a graph

2008
EU Av              911.28
EU Max            1594.00
EU Min             625.11
Austria            883.95
Belgium            941.92
Bulgaria             0.00
Czech Republic       0.00
Germany            877.36
Denmark           1200.00
Estonia              0.00
Greece            1096.52
Spain              873.36
Finland            667.19
France             922.33
Croatia              0.00
Hungary              0.00
Ireland              0.00
Italy             1184.49
Lithuania            0.00
Luxembourg         877.36
Latvia               0.00
Malta             1593.37
Netherlands        934.39
Poland             399.41
Portugal           933.15
Romania            683.05
Sweden             668.41
Slovenia             0.00
Slovakia             0.00
United Kingdom       0.00
Brazil             733.17
Canada             459.93
China             1371.24
India             1129.26
Japan             1051.62
South Africa         0.00
South Korea       1349.13
Turkey               0.00
USA                905.70
Switzerland        992.14
Norway             586.98
dtype: float64
2009
EU Av              570.48
EU Max            1163.13
EU Min             415.56
Austria            516.31
Belgium            520.52
Bulgaria             0.00
Czech Republic     130.97
Germany            513.76
Denmark           1200.00
Estonia              0.00
Greece             573.10
Spain              499.67
Finland            489.05
France             568.11
Croatia              0.00
Hungary              0.00
Ireland              0.00
Italy              885.90
Lithuania            0.00
Luxembourg         513.76
Latvia               0.00
Malta             1163.13
Netherlands        517.88
Poland             517.50
Portugal           497.27
Romania            452.42
Sweden             489.44
Slovenia             0.00
Slovakia             0.00
United Kingdom       0.00
Brazil             171.70
Canada             283.01
China             1434.83
India             1407.18
Japan              595.14
South Africa         0.00
South Korea       1112.12
Turkey               0.00
USA                464.06
Switzerland        634.38
Norway             463.43
dtype: float64
2010
EU Av              630.57
EU Max            1189.92
EU Min             420.95
Austria            587.85
Belgium            607.35
Bulgaria             0.00
Czech Republic     573.13
Germany            583.50
Denmark            679.83
Estonia            455.78
Greece             599.11
Spain              484.93
Finland            746.08
France             622.99
Croatia              0.00
Hungary            341.13
Ireland            720.39
Italy              841.12
Lithuania            0.00
Luxembourg         583.50
Latvia               0.00
Malta             1178.07
Netherlands        595.12
Poland             630.87
Portugal           482.70
Romania            478.58
Sweden             748.37
Slovenia           416.32
Slovakia           572.65
United Kingdom       0.00
Brazil             360.71
Canada             332.88
China             1408.67
India              807.03
Japan              726.00
South Africa         0.00
South Korea       1210.70
Turkey               0.00
USA                511.98
Switzerland        669.67
Norway             697.41
dtype: float64
2011
EU Av              691.03
EU Max            1207.73
EU Min             512.22
Austria            674.31
Belgium            641.50
Bulgaria             0.00
Czech Republic     656.84
Germany            664.06
Denmark            632.60
Estonia            563.15
Greece             770.69
Spain              639.06
Finland            641.10
France             635.26
Croatia              0.00
Hungary            724.64
Ireland            808.60
Italy              937.44
Lithuania            0.00
Luxembourg         664.06
Latvia               0.00
Malta             1207.73
Netherlands        676.01
Poland             637.38
Portugal           654.93
Romania            676.42
Sweden             622.57
Slovenia           742.61
Slovakia           661.13
United Kingdom       0.00
Brazil             124.57
Canada             269.35
China             1320.94
India              715.88
Japan             1126.25
South Africa         0.00
South Korea       1281.24
Turkey              48.53
USA                464.62
Switzerland        730.07
Norway             612.03
dtype: float64
2012
EU Av              621.59
EU Max            1220.68
EU Min             402.96
Austria            554.90
Belgium            603.41
Bulgaria             0.00
Czech Republic     544.48
Germany            546.85
Denmark            475.48
Estonia            502.85
Greece             723.65
Spain              605.72
Finland            471.13
France             604.56
Croatia              0.00
Hungary            661.28
Ireland            839.32
Italy              968.16
Lithuania          291.66
Luxembourg         546.85
Latvia               0.00
Malta             1220.68
Netherlands        615.72
Poland             540.29
Portugal           616.60
Romania            626.50
Sweden             415.83
Slovenia           682.87
Slovakia           550.12
United Kingdom       0.00
Brazil             656.20
Canada             202.57
China             1325.05
India              657.48
Japan             1424.03
South Africa         0.00
South Korea       1612.95
Turkey             538.51
USA                382.27
Switzerland        636.70
Norway             401.31
dtype: float64
2013
EU Av              559.16
EU Max            1173.56
EU Min             395.28
Austria            480.87
Belgium            601.71
Bulgaria             0.00
Czech Republic     465.77
Germany            479.01
Denmark            498.01
Estonia            550.43
Greece             525.11
Spain              559.68
Finland            520.62
France             548.35
Croatia              0.00
Hungary            536.02
Ireland            853.70
Italy              797.34
Lithuania          619.39
Luxembourg         479.01
Latvia             328.67
Malta             1164.87
Netherlands        658.06
Poland             464.19
Portugal           551.91
Romania            447.17
Sweden             499.54
Slovenia           546.73
Slovakia           471.42
United Kingdom       0.00
Brazil             969.99
Canada             219.33
China             1299.80
India              494.88
Japan             1501.14
South Africa         0.00
South Korea       1513.55
Turkey             510.84
USA                501.21
Switzerland        567.21
Norway             482.59
dtype: float64
2014
EU Av              487.54
EU Max            1014.18
EU Min             342.88
Austria            412.63
Belgium            511.76
Bulgaria             0.00
Czech Republic     413.67
Germany            411.26
Denmark            394.05
Estonia            471.46
Greece             717.50
Spain              531.86
Finland            451.64
France             434.91
Croatia              0.00
Hungary            507.77
Ireland            716.77
Italy              653.18
Lithuania          628.35
Luxembourg         411.26
Latvia             628.25
Malta             1014.18
Netherlands        516.90
Poland             536.79
Portugal           522.95
Romania            434.57
Sweden             396.56
Slovenia           506.84
Slovakia           422.22
United Kingdom     538.68
Brazil            2256.12
Canada             283.84
China             1302.05
India              608.23
Japan             1500.27
South Africa         0.00
South Korea       1405.94
Turkey             520.18
USA                576.27
Switzerland        462.13
Norway             371.42
dtype: float64
2015
EU Av              484.00
EU Max             721.40
EU Min             269.71
Austria            391.95
Belgium            555.80
Bulgaria             0.00
Czech Republic     400.49
Germany            392.11
Denmark            294.08
Estonia            384.91
Greece             642.83
Spain              632.09
Finland            367.91
France             476.82
Croatia              0.00
Hungary            504.38
Ireland            613.25
Italy              647.32
Lithuania          518.61
Luxembourg         392.11
Latvia             517.71
Malta              711.54
Netherlands        496.26
Poland             467.89
Portugal           623.40
Romania            450.58
Sweden             273.19
Slovenia           512.41
Slovakia           415.79
United Kingdom     689.68
Brazil             908.50
Canada             191.11
China             1299.87
India              467.44
Japan             1009.51
South Africa       691.74
South Korea        978.87
Turkey             405.69
USA                376.39
Switzerland        499.52
Norway             260.47
dtype: float64
2016
EU Av              429.44
EU Max             625.06
EU Min             332.71
Austria            358.56
Belgium            451.87
Bulgaria           386.17
Czech Republic     383.38
Germany            355.36
Denmark            343.75
Estonia            405.68
Greece             525.66
Spain              491.18
Finland            397.99
France             453.47
Croatia              0.00
Hungary            434.67
Ireland            492.59
Italy              524.55
Lithuania          448.03
Luxembourg         355.36
Latvia             442.52
Malta              584.00
Netherlands        395.73
Poland             449.62
Portugal           483.28
Romania            407.90
Sweden             358.41
Slovenia           436.39
Slovakia           386.66
United Kingdom     602.90
Brazil             343.51
Canada             133.30
China             1271.00
India              385.78
Japan              725.77
South Africa       798.28
South Korea        727.20
Turkey             380.32
USA                322.87
Switzerland        464.53
Norway             329.97
dtype: float64
2017
EU Av              516.91
EU Max             766.21
EU Min             366.46
Austria            422.47
Belgium            542.91
Bulgaria           477.54
Czech Republic     445.74
Germany            419.28
Denmark            377.15
Estonia            403.70
Greece             664.75
Spain              638.37
Finland            403.59
France             548.34
Croatia              0.00
Hungary            611.99
Ireland            563.39
Italy              655.49
Lithuania          424.27
Luxembourg         419.28
Latvia             424.63
Malta              737.47
Netherlands        478.28
Poland             453.00
Portugal           644.95
Romania            585.68
Sweden             379.82
Slovenia           601.78
Slovakia           497.89
United Kingdom     629.09
Brazil             884.15
Canada             124.10
China             1211.64
India              467.12
Japan              853.75
South Africa       497.77
South Korea        755.24
Turkey             401.86
USA                366.36
Switzerland        531.84
Norway             357.69
dtype: float64
2018
EU Av              612.04
EU Max             855.53
EU Min             446.40
Austria            555.35
Belgium            662.89
Bulgaria           478.42
Czech Republic     551.99
Germany            533.44
Denmark            541.16
Estonia            564.52
Greece             724.03
Spain              687.43
Finland            561.29
France             602.36
Croatia            623.01
Hungary            611.26
Ireland            742.82
Italy              735.41
Lithuania          598.27
Luxembourg         533.44
Latvia             599.53
Malta              832.82
Netherlands        629.78
Poland             629.03
Portugal           689.27
Romania            556.90
Sweden             534.14
Slovenia           613.32
Slovakia           581.26
United Kingdom     778.26
Brazil             754.38
Canada             187.63
China             1138.64
India              584.20
Japan             1015.44
South Africa       501.71
South Korea        878.49
Turkey             487.22
USA                453.01
Switzerland        626.45
Norway             527.57
dtype: float64
2019
EU Av              510.90
EU Max             773.81
EU Min             405.11
Austria              0.00
Belgium              0.00
Bulgaria             0.00
Czech Republic     474.52
Germany            444.64
Denmark            462.20
Estonia            540.92
Greece             752.85
Spain              562.72
Finland            519.42
France             465.70
Croatia              0.00
Hungary            593.46
Ireland              0.00
Italy              617.45
Lithuania          544.06
Luxembourg           0.00
Latvia             545.87
Malta              740.27
Netherlands          0.00
Poland               0.00
Portugal             0.00
Romania            593.57
Sweden             452.77
Slovenia             0.00
Slovakia           489.70
United Kingdom     578.23
Brazil             518.71
Canada             136.68
China             1010.41
India              444.66
Japan              776.22
South Africa       699.72
South Korea        832.91
Turkey             470.57
USA                355.32
Switzerland          0.00
Norway             459.57
dtype: float64

### With aggregation

You can also add aggregation functions to the groupby statement

In [53]:
yearly_sums = data.groupby(data.index.year).sum()

In [54]:
yearly_sums

,EU Av,EU Max,EU Min,Austria,Belgium,Bulgaria,Czech Republic,Germany,Denmark,Estonia,...,Canada,China,India,Japan,South Africa,South Korea,Turkey,USA,Switzerland,Norway
Date,,,,,,,,,,,,,,,,,,,,,
2008,911.28,1594.00,625.11,883.95,941.92,0.00,0.00,877.36,1200.00,0.00,...,459.93,1371.24,1129.26,1051.62,0.00,1349.13,0.00,905.70,992.14,586.98
2009,570.48,1163.13,415.56,516.31,520.52,0.00,130.97,513.76,1200.00,0.00,...,283.01,1434.83,1407.18,595.14,0.00,1112.12,0.00,464.06,634.38,463.43
2010,630.57,1189.92,420.95,587.85,607.35,0.00,573.13,583.50,679.83,455.78,...,332.88,1408.67,807.03,726.00,0.00,1210.70,0.00,511.98,669.67,697.41
2011,691.03,1207.73,512.22,674.31,641.50,0.00,656.84,664.06,632.60,563.15,...,269.35,1320.94,715.88,1126.25,0.00,1281.24,48.53,464.62,730.07,612.03
2012,621.59,1220.68,402.96,554.90,603.41,0.00,544.48,546.85,475.48,502.85,...,202.57,1325.05,657.48,1424.03,0.00,1612.95,538.51,382.27,636.70,401.31
2013,559.16,1173.56,395.28,480.87,601.71,0.00,465.77,479.01,498.01,550.43,...,219.33,1299.80,494.88,1501.14,0.00,1513.55,510.84,501.21,567.21,482.59
2014,487.54,1014.18,342.88,412.63,511.76,0.00,413.67,411.26,394.05,471.46,...,283.84,1302.05,608.23,1500.27,0.00,1405.94,520.18,576.27,462.13,371.42
2015,484.00,721.40,269.71,391.95,555.80,0.00,400.49,392.11,294.08,384.91,...,191.11,1299.87,467.44,1009.51,691.74,978.87,405.69,376.39,499.52,260.47
2016,429.44,625.06,332.71,358.56,451.87,386.17,383.38,355.36,343.75,405.68,...,133.30,1271.00,385.78,725.77,798.28,727.20,380.32,322.87,464.53,329.97
2017,516.91,766.21,366.46,422.47,542.91,477.54,445.74,419.28,377.15,403.70,...,124.10,1211.64,467.12,853.75,497.77,755.24,401.86,366.36,531.84,357.69
2018,612.04,855.53,446.40,555.35,662.89,478.42,551.99,533.44,541.16,564.52,...,187.63,1138.64,584.20,1015.44,501.71,878.49,487.22,453.01,626.45,527.57
2019,510.90,773.81,405.11,0.00,0.00,0.00,474.52,444.64,462.20,540.92,...,136.68,1010.41,444.66,776.22,699.72,832.91,470.57,355.32,0.00,459.57

### With specific column aggregation

By chaining the `.agg` method & feeding it a dictionary `{col_name : agg_method}`

In [55]:
yearly_data = data.groupby(data.index.month).agg({'EU Av':'mean',
                                                  'EU Max': 'max',
                                                  'EU Min': 'min'})

In [56]:
yearly_data

          EU Av  EU Max  EU Min
Date
1     52.187500  123.92   28.31
2     50.774167  116.08   16.09
3     45.146667   97.86   21.47
4     44.198333  114.52   16.97
5     43.513333  146.81   23.05
6     45.325000  131.09   15.77
7     48.073333  170.85    9.35
8     47.796667  173.56   17.21
9     52.001667  161.82   21.58
10    53.924167  147.24   24.37
11    52.405833  121.65   26.50
12    50.065000  117.67   19.88

## Resample

Similar to groupby for timeseries indices only

In [57]:
yearly_data = data.resample('Y').sum()

In [58]:
yearly_data.head(3)

,EU Av,EU Max,EU Min,Austria,Belgium,Bulgaria,Czech Republic,Germany,Denmark,Estonia,...,Canada,China,India,Japan,South Africa,South Korea,Turkey,USA,Switzerland,Norway
Date,,,,,,,,,,,,,,,,,,,,,
2008-12-31,911.28,1594.00,625.11,883.95,941.92,0.0,0.00,877.36,1200.00,0.00,...,459.93,1371.24,1129.26,1051.62,0.0,1349.13,0.0,905.70,992.14,586.98
2009-12-31,570.48,1163.13,415.56,516.31,520.52,0.0,130.97,513.76,1200.00,0.00,...,283.01,1434.83,1407.18,595.14,0.0,1112.12,0.0,464.06,634.38,463.43
2010-12-31,630.57,1189.92,420.95,587.85,607.35,0.0,573.13,583.50,679.83,455.78,...,332.88,1408.67,807.03,726.00,0.0,1210.70,0.0,511.98,669.67,697.41

# Exporting to Excel

## Documentation

[Documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_csv.html) of `to_csv` function

## Exporting as excel file (.xlsx)

In [59]:
data.to_excel('File name.xlsx') # Note the file format added at the end of file name!

## Exporting as csv file (.csv)

In [60]:
data.to_csv('File name.csv') # Note the file format added at the end of file name!

## Exporting specific columns of DataFrame

In [61]:
data[['EU Av','EU Max','EU Min']].to_csv('EU_data.csv')